app/controllers/callcenters_controller.rb

SELECT "callcenters".* FROM "callcenters"
---
  def index
    @callcenters = Callcenter.all