app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("campaign_id", "created_at", "name", "password_digest", "role_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["campaign_id", 1], ["created_at", "2014-06-23 03:30:48.087865"], ["name", "Juan Angel"], ["password_digest", "Scipio0211"], ["role_id", 1], ["updated_at", "2014-06-23 03:30:48.087865"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "campaign_id" = $1, "role_id" = $2, "updated_at" = $3 WHERE "users"."id" = 1  [["campaign_id", 0], ["role_id", 0], ["updated_at", "2014-06-23 03:31:36.879872"]]